Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_service_dual_modem/src/packs/PIC32CX2051MTG128_DFP/component/pmc.h
#define PMC_PLL_ISR1_UDR_Pos                  _UINT32_(0)                                          /* (PMC_PLL_ISR1 Position) PLLx Underflow */
#define PMC_PLL_ISR1_UDR_Msk                  (_UINT32_(0x7) << PMC_PLL_ISR1_UDR_Pos)              /* (PMC_PLL_ISR1 Mask) UDR */
#define PMC_PLL_ISR1_UDR(value)               (PMC_PLL_ISR1_UDR_Msk & (_UINT32_(value) << PMC_PLL_ISR1_UDR_Pos)) 
#define PMC_PLL_ISR1_OVR_Pos                  _UINT32_(16)                                         /* (PMC_PLL_ISR1 Position) PLLx Overflow */
#define PMC_PLL_ISR1_OVR_Msk                  (_UINT32_(0x7) << PMC_PLL_ISR1_OVR_Pos)              /* (PMC_PLL_ISR1 Mask) OVR */
#define PMC_PLL_ISR1_OVR(value)               (PMC_PLL_ISR1_OVR_Msk & (_UINT32_(value) << PMC_PLL_ISR1_OVR_Pos)) 

/** \brief PMC register offsets definitions */
#define PMC_SCER_REG_OFST              _UINT32_(0x00)      /* (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_REG_OFST              _UINT32_(0x04)      /* (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_REG_OFST              _UINT32_(0x08)      /* (PMC_SCSR) System Clock Status Register Offset */
#define PMC_PLL_CTRL0_REG_OFST         _UINT32_(0x0C)      /* (PMC_PLL_CTRL0) PLL Control Register 0 Offset */
#define PMC_PLL_CTRL1_REG_OFST         _UINT32_(0x10)      /* (PMC_PLL_CTRL1) PLL Control Register 1 Offset */
#define PMC_PLL_CTRL2_REG_OFST         _UINT32_(0x14)      /* (PMC_PLL_CTRL2) PLL Control Register 2 Offset */
#define PMC_PLL_SSR_REG_OFST           _UINT32_(0x18)      /* (PMC_PLL_SSR) PLL Spread Spectrum Register Offset */
#define PMC_PLL_ACR_REG_OFST           _UINT32_(0x1C)      /* (PMC_PLL_ACR) PLL Analog Control Register Offset */
#define PMC_PLL_UPDT_REG_OFST          _UINT32_(0x20)      /* (PMC_PLL_UPDT) PLL Update Register Offset */
#define CKGR_MOR_REG_OFST              _UINT32_(0x24)      /* (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_REG_OFST             _UINT32_(0x28)      /* (CKGR_MCFR) Main Clock Frequency Register Offset */
#define PMC_CPU_CKR_REG_OFST           _UINT32_(0x2C)      /* (PMC_CPU_CKR) CPU Clock Register Offset */
#define PMC_PCK_REG_OFST               _UINT32_(0x44)      /* (PMC_PCK) Programmable Clock Register (chid = 0) Offset */
#define PMC_PCK0_REG_OFST              _UINT32_(0x44)      /* (PMC_PCK0) Programmable Clock Register (chid = 0) Offset */
#define PMC_PCK1_REG_OFST              _UINT32_(0x48)      /* (PMC_PCK1) Programmable Clock Register (chid = 0) Offset */
#define PMC_PCK2_REG_OFST              _UINT32_(0x4C)      /* (PMC_PCK2) Programmable Clock Register (chid = 0) Offset */
#define PMC_IER_REG_OFST               _UINT32_(0x64)      /* (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_REG_OFST               _UINT32_(0x68)      /* (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_REG_OFST                _UINT32_(0x6C)      /* (PMC_SR) Status Register Offset */
#define PMC_IMR_REG_OFST               _UINT32_(0x70)      /* (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FSMR_REG_OFST              _UINT32_(0x74)      /* (PMC_FSMR) Fast Start-up Mode Register Offset */
#define PMC_WCR_REG_OFST               _UINT32_(0x78)      /* (PMC_WCR) Wake-up Control Register Offset */
#define PMC_FOCR_REG_OFST              _UINT32_(0x7C)      /* (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_CPFSMR_REG_OFST            _UINT32_(0x80)      /* (PMC_CPFSMR) Coprocessor Fast Start-up Mode Register Offset */
#define PMC_WPMR_REG_OFST              _UINT32_(0x84)      /* (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_REG_OFST              _UINT32_(0x88)      /* (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCR_REG_OFST               _UINT32_(0x8C)      /* (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR_REG_OFST               _UINT32_(0x90)      /* (PMC_OCR) Oscillator Calibration Register Offset */
#define PMC_SLPWK_AIPR_REG_OFST        _UINT32_(0x94)      /* (PMC_SLPWK_AIPR) Partial Wake-up Activity In Progress Register Offset */
#define PMC_SLPWKCR_REG_OFST           _UINT32_(0x98)      /* (PMC_SLPWKCR) Partial Wake-up Control Register Offset */
#define PMC_MCKLIM_REG_OFST            _UINT32_(0xA0)      /* (PMC_MCKLIM) MCK0 Monitor Limits Register Offset */
#define PMC_CSR0_REG_OFST              _UINT32_(0xA4)      /* (PMC_CSR0) Peripheral Clock Status Register 0 Offset */
#define PMC_CSR1_REG_OFST              _UINT32_(0xA8)      /* (PMC_CSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_CSR2_REG_OFST              _UINT32_(0xAC)      /* (PMC_CSR2) Peripheral Clock Status Register 2 Offset */
#define PMC_CSR3_REG_OFST              _UINT32_(0xB0)      /* (PMC_CSR3) Peripheral Clock Status Register 3 Offset */
#define PMC_GCSR0_REG_OFST             _UINT32_(0xC4)      /* (PMC_GCSR0) Generic Clock Status Register 0 Offset */
#define PMC_GCSR1_REG_OFST             _UINT32_(0xC8)      /* (PMC_GCSR1) Generic Clock Status Register 1 Offset */
#define PMC_GCSR2_REG_OFST             _UINT32_(0xCC)      /* (PMC_GCSR2) Generic Clock Status Register 2 Offset */
#define PMC_GCSR3_REG_OFST             _UINT32_(0xD0)      /* (PMC_GCSR3) Generic Clock Status Register 3 Offset */
#define PMC_PLL_IER_REG_OFST           _UINT32_(0xE4)      /* (PMC_PLL_IER) PLL Interrupt Enable Register Offset */
#define PMC_PLL_IDR_REG_OFST           _UINT32_(0xE8)      /* (PMC_PLL_IDR) PLL Interrupt Disable Register Offset */
#define PMC_PLL_IMR_REG_OFST           _UINT32_(0xEC)      /* (PMC_PLL_IMR) PLL Interrupt Mask Register Offset */
#define PMC_PLL_ISR0_REG_OFST          _UINT32_(0xF0)      /* (PMC_PLL_ISR0) PLL Interrupt Status Register 0 Offset */
#define PMC_PLL_ISR1_REG_OFST          _UINT32_(0xF4)      /* (PMC_PLL_ISR1) PLL Interrupt Status Register 1 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PMC register API structure */
typedef struct
{
  __O   uint32_t                       PMC_SCER;           /**< Offset: 0x00 ( /W  32) System Clock Enable Register */
  __O   uint32_t                       PMC_SCDR;           /**< Offset: 0x04 ( /W  32) System Clock Disable Register */
  __I   uint32_t                       PMC_SCSR;           /**< Offset: 0x08 (R/   32) System Clock Status Register */
  __IO  uint32_t                       PMC_PLL_CTRL0;      /**< Offset: 0x0C (R/W  32) PLL Control Register 0 */
  __IO  uint32_t                       PMC_PLL_CTRL1;      /**< Offset: 0x10 (R/W  32) PLL Control Register 1 */
  __IO  uint32_t                       PMC_PLL_CTRL2;      /**< Offset: 0x14 (R/W  32) PLL Control Register 2 */
  __IO  uint32_t                       PMC_PLL_SSR;        /**< Offset: 0x18 (R/W  32) PLL Spread Spectrum Register */
  __IO  uint32_t                       PMC_PLL_ACR;        /**< Offset: 0x1C (R/W  32) PLL Analog Control Register */
  __IO  uint32_t                       PMC_PLL_UPDT;       /**< Offset: 0x20 (R/W  32) PLL Update Register */
  __IO  uint32_t                       CKGR_MOR;           /**< Offset: 0x24 (R/W  32) Main Oscillator Register */
  __IO  uint32_t                       CKGR_MCFR;          /**< Offset: 0x28 (R/W  32) Main Clock Frequency Register */
  __IO  uint32_t                       PMC_CPU_CKR;        /**< Offset: 0x2C (R/W  32) CPU Clock Register */
  __I   uint8_t                        Reserved1[0x14];
  __IO  uint32_t                       PMC_PCK[3];         /**< Offset: 0x44 (R/W  32) Programmable Clock Register (chid = 0) */
  __I   uint8_t                        Reserved2[0x14];
  __O   uint32_t                       PMC_IER;            /**< Offset: 0x64 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       PMC_IDR;            /**< Offset: 0x68 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       PMC_SR;             /**< Offset: 0x6C (R/   32) Status Register */
  __I   uint32_t                       PMC_IMR;            /**< Offset: 0x70 (R/   32) Interrupt Mask Register */
  __IO  uint32_t                       PMC_FSMR;           /**< Offset: 0x74 (R/W  32) Fast Start-up Mode Register */
  __IO  uint32_t                       PMC_WCR;            /**< Offset: 0x78 (R/W  32) Wake-up Control Register */
  __O   uint32_t                       PMC_FOCR;           /**< Offset: 0x7C ( /W  32) Fault Output Clear Register */
  __IO  uint32_t                       PMC_CPFSMR;         /**< Offset: 0x80 (R/W  32) Coprocessor Fast Start-up Mode Register */
  __IO  uint32_t                       PMC_WPMR;           /**< Offset: 0x84 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       PMC_WPSR;           /**< Offset: 0x88 (R/   32) Write Protection Status Register */
  __IO  uint32_t                       PMC_PCR;            /**< Offset: 0x8C (R/W  32) Peripheral Control Register */
  __IO  uint32_t                       PMC_OCR;            /**< Offset: 0x90 (R/W  32) Oscillator Calibration Register */
  __I   uint32_t                       PMC_SLPWK_AIPR;     /**< Offset: 0x94 (R/   32) Partial Wake-up Activity In Progress Register */
  __IO  uint32_t                       PMC_SLPWKCR;        /**< Offset: 0x98 (R/W  32) Partial Wake-up Control Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       PMC_MCKLIM;         /**< Offset: 0xA0 (R/W  32) MCK0 Monitor Limits Register */
  __I   uint32_t                       PMC_CSR0;           /**< Offset: 0xA4 (R/   32) Peripheral Clock Status Register 0 */
  __I   uint32_t                       PMC_CSR1;           /**< Offset: 0xA8 (R/   32) Peripheral Clock Status Register 1 */
  __I   uint32_t                       PMC_CSR2;           /**< Offset: 0xAC (R/   32) Peripheral Clock Status Register 2 */
  __I   uint32_t                       PMC_CSR3;           /**< Offset: 0xB0 (R/   32) Peripheral Clock Status Register 3 */
  __I   uint8_t                        Reserved4[0x10];
  __I   uint32_t                       PMC_GCSR0;          /**< Offset: 0xC4 (R/   32) Generic Clock Status Register 0 */
  __I   uint32_t                       PMC_GCSR1;          /**< Offset: 0xC8 (R/   32) Generic Clock Status Register 1 */
  __I   uint32_t                       PMC_GCSR2;          /**< Offset: 0xCC (R/   32) Generic Clock Status Register 2 */
  __I   uint32_t                       PMC_GCSR3;          /**< Offset: 0xD0 (R/   32) Generic Clock Status Register 3 */
  __I   uint8_t                        Reserved5[0x10];
  __O   uint32_t                       PMC_PLL_IER;        /**< Offset: 0xE4 ( /W  32) PLL Interrupt Enable Register */
  __O   uint32_t                       PMC_PLL_IDR;        /**< Offset: 0xE8 ( /W  32) PLL Interrupt Disable Register */
  __I   uint32_t                       PMC_PLL_IMR;        /**< Offset: 0xEC (R/   32) PLL Interrupt Mask Register */
  __I   uint32_t                       PMC_PLL_ISR0;       /**< Offset: 0xF0 (R/   32) PLL Interrupt Status Register 0 */
  __I   uint32_t                       PMC_PLL_ISR1;       /**< Offset: 0xF4 (R/   32) PLL Interrupt Status Register 1 */
} pmc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTG_PMC_COMPONENT_H_ */
